* 

* [2019-02-03 Sun]
** presence
   :LOGBOOK:
   CLOCK: [2019-02-03 Sun 09:30]--[2019-02-03 Sun 19:45] => 10:15
   :END:
** time slots
*** java class
    - memory model
    - computer architecture
    :LOGBOOK:
    CLOCK: [2019-02-03 Sun 15:10]--[2019-02-03 Sun 17:40] =>  2:30
    CLOCK: [2019-02-03 Sun 09:30]--[2019-02-03 Sun 12:55] =>  3:25
    :END:
*** amir hosein project discussion
    :LOGBOOK:
    CLOCK: [2019-02-03 Sun 14:20]--[2019-02-03 Sun 15:00] =>  0:40
    :END:
